IDENTIFICATION DIVISION.
PROGRAM-ID. BANK-ACCOUNT.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT BANK-FILE ASSIGN TO "BANK.DAT"
        ORGANIZATION IS LINE SEQUENTIAL.
        FILE STATUS IS WS-FILE-STATUS.

DATA DIVISION.
FILE SECTION.
FD BANK-FILE.
01 BANK-REC.
    05 ACCOUNT-NUM PIC 9(4).
    05 CUSTOMER-NAME PIC X(20).
    05 BALANCE PIC 9(9)V99.

WORKING-STORAGE SECTION.
01 WS-ACCOUNT-NUM PIC 9(4).
01 WS-CUSTOMER-NAME PIC X(20).
01 WS-DEPOSIT-AMT PIC 9(9)V99.
01 WS-WITHDRAW-AMT PIC 9(9)V99.
01 WS-BALANCE PIC 9(9)V99.
01 WS-FILE-STATUS PIC XX.

PROCEDURE DIVISION.
MAIN-ROUTINE.
    OPEN I-O BANK-FILE.
    DISPLAY "===============================".
    DISPLAY "BANK ACCOUNT MANAGEMENT SYSTEM".
    DISPLAY "===============================".
    PERFORM UNTIL WS-ACCOUNT-NUM = 9999
        DISPLAY "ENTER ACCOUNT NUMBER (0 TO EXIT): ".
        ACCEPT WS-ACCOUNT-NUM.
        IF WS-ACCOUNT-NUM = 0
            GO TO EXIT-PROGRAM
        END-IF.
        PERFORM READ-ACCOUNT.
        IF WS-FILE-STATUS = "00"
            DISPLAY "CUSTOMER NAME: " WS-CUSTOMER-NAME
            DISPLAY "CURRENT BALANCE: " WS-BALANCE
            PERFORM TRANSACTION-LOOP
        ELSE
            DISPLAY "ACCOUNT NOT FOUND"
        END-IF.
    END-PERFORM.
    EXIT-PROGRAM.
        CLOSE BANK-FILE
        STOP RUN.

READ-ACCOUNT.
    READ BANK-FILE
        AT END SET WS-FILE-STATUS TO "10"
        NOT AT END
            IF ACCOUNT-NUM = WS-ACCOUNT-NUM
                SET WS-CUSTOMER-NAME TO CUSTOMER-NAME
                SET WS-BALANCE TO BALANCE
            END-IF.
    END-READ.

TRANSACTION-LOOP.
    DISPLAY "1. DEPOSIT"
    DISPLAY "2. WITHDRAW"
    DISPLAY "3. RETURN TO MAIN MENU"
    DISPLAY "SELECT TRANSACTION: "
    ACCEPT WS-CHOICE.
    IF WS-CHOICE = 1
        PERFORM DEPOSIT
    ELSE IF WS-CHOICE = 2
        PERFORM WITHDRAW
    ELSE IF WS-CHOICE = 3
        GO TO MAIN-ROUTINE
    END-IF.
    GO TO TRANSACTION-LOOP.

DEPOSIT.
    DISPLAY "ENTER DEPOSIT AMOUNT: "
    ACCEPT WS-DEPOSIT-AMT.
    COMPUTE WS-BALANCE = WS-BALANCE + WS-DEPOSIT-AMT
    DISPLAY "NEW BALANCE: " WS-BALANCE
    PERFORM WRITE-ACCOUNT.

WITHDRAW.
    DISPLAY "ENTER WITHDRAW AMOUNT: "
    ACCEPT WS-WITHDRAW-AMT.
    IF WS-WITHDRAW-AMT > WS-BALANCE
        DISPLAY "INSUFFICIENT FUNDS"
    ELSE
        COMPUTE WS-BALANCE = WS-BALANCE - WS-WITHDRAW-AMT
        DISPLAY "NEW BALANCE: " WS-BALANCE